tutorials/parallelPanel/8-ft-panel-pmma/0/fuelRegion/v
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/pyrolysisRegion";
    object      v;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 1;

boundaryField
{
    fuel_top
    {
        type            zeroGradient;
    }

    region0_to_fuelRegion_fuel
    {
        type            zeroGradient;
    }

    fuel_side
    {
        type empty;
    }
}
// ************************************************************************* //
