tutorials/parallelPanel/8-ft-panel-pmma/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-4;

boundaryField
{
    wall
    {
        type		    fixedValue;
        value		    uniform 0;
    }

    ground
    {
        type            zeroGradient;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    "(side|Radgauge)"
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    burner
    {
        type            fixedValue;
        value           $internalField;
    }

    "(region0_to_fuelRegion_fuel|HFgauge)"
    {
        type            fixedValue;
        value           $internalField;
    }
}
// ************************************************************************* //
