tutorials/parallelPanel/8-ft-panel-pmma/constant/pyrolysisZones
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      pyrolysisZones;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

pyrolysisBox
{
    active              true;

    pyrolysisModel      reactingOneDimFF;

    region              fuelRegion;
    pyrolysisRegion     fuelRegion;

    reactingOneDimFFCoeffs
    {
        gasHSource          no; //Energy source term due to pyrolysis gas
        qrHSource           no; //Energy source term due in depth radiation

        filmCoupled         false;
    
        radFluxName         Qr;
    
        moveMesh            true;
        minimumDelta        1e-6;
        useChemistrySolvers false;

	thickness	0.007;

    }
    infoOutput          true;
}
// ************************************************************************* //
