tutorials/parallelPanel/8-ft-panel-pmma/system/blockMeshDict
/*-----------------------------*-C++-*---------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;

    root            "";
    case            "";
    instance        "";
    local           "";

    class           dictionary;
    object          blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-120 -120   0)
    ( 120 -120   0)
    ( 120  120   0)
    (-120  120   0)
    (-120 -120 200)
    ( 120 -120 200)
    ( 120  120 200)
    (-120  120 200)
);

blocks
(
    hex (0 1 2 3 4 5 6 7)   (30 30 25) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    side
    {
        type patch;
        faces
        (
            (1 2 6 5)
            (0 1 5 4)
            (0 4 7 3)
            (7 6 2 3)
        );
    }

    outlet
    {
     type patch;
        faces
        (
           (4 5 6 7)
        );
    }

    ground
    {
     type wall;
        faces
        (
           (0 3 2 1)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
