tutorials/parallelPanel/8-ft-panel-pmma/system/topoSetDict.pyrolysis
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // create face
    {
        name    fuel;
        type    faceSet;
        action  new;
        source  patchToFace;
        sourceInfo
        {
            name fuel;
        }
    }
    {
        name    fuel;
        type    faceZoneSet;
        action  new;
        source  setToFaceZone;
        sourceInfo
        {
            faceSet fuel;
        }
    }
);
// ************************************************************************* //
